Revit 2027 API
ModelText.HorizontalAlignment Property
The horizontal alignment.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public HorizontalAlign HorizontalAlignment { get; set; }
Public Property HorizontalAlignment As HorizontalAlign
	Get
	Set
public:
property HorizontalAlign HorizontalAlignment {
	HorizontalAlign get ();
	void set (HorizontalAlign value);
}
member HorizontalAlignment : HorizontalAlign with get, set
Property Value
HorizontalAlign
Exceptions
Exception | Condition
ArgumentException |  Thrown when an invalid value is assigned to the property.
See Also
Reference
ModelText Class
Autodesk.Revit.DB Namespace